In [32]:
people = {
    "first": ['Sueda', 'Jane', 'John', 'amy'], 
    "last": ['Ciftci', 'Doe', 'Ozg', 'Doe'], 
    "email": ["sueda@gmail.com", 'edasu@email.com', 'doee@email.com', 'doec@email.com']
}

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame(people)

In [35]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     Doe  edasu@email.com
2   John     Ozg   doee@email.com
3    amy     Doe   doec@email.com

In [36]:
df.sort_values(by='last', ascending=False)

   first    last            email
2   John     Ozg   doee@email.com
1   Jane     Doe  edasu@email.com
3    amy     Doe   doec@email.com
0  Sueda  Ciftci  sueda@gmail.com

In [37]:
df.sort_values(by=['last', 'first'], ascending= [False, True])

   first    last            email
2   John     Ozg   doee@email.com
1   Jane     Doe  edasu@email.com
3    amy     Doe   doec@email.com
0  Sueda  Ciftci  sueda@gmail.com

In [38]:
df.sort_index()

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     Doe  edasu@email.com
2   John     Ozg   doee@email.com
3    amy     Doe   doec@email.com

In [40]:
df['last'].sort_values()

0    Ciftci
1       Doe
3       Doe
2       Ozg
Name: last, dtype: object